mafeiGitHub/stm32Mp3/fatfs/diskio.c
// diskio.c
#include <stdlib.h>
#include "ff.h"
#include "diskio.h"
#include "../Bsp/stm32746g_discovery_sd.h"

#define BLOCK_SIZE 512

static volatile DSTATUS Stat = STA_NOINIT;

/*{{{*/
__weak DWORD get_fattime() {
  return 0;
  }
/*}}}*/

/*{{{*/
DSTATUS disk_status (BYTE pdrv) {

  Stat = STA_NOINIT;
  if (BSP_SD_GetStatus() == MSD_OK)
    Stat &= ~STA_NOINIT;
  return Stat;
  }
/*}}}*/
/*{{{*/
DSTATUS disk_initialize (BYTE pdrv) {

  Stat = STA_NOINIT;
  if (BSP_SD_Init() == MSD_OK)
    Stat &= ~STA_NOINIT;
  return Stat;
  }
/*}}}*/
/*{{{*/
DRESULT disk_ioctl (BYTE pdrv, BYTE cmd, void* buff) {

  DRESULT res = RES_ERROR;
  if (Stat & STA_NOINIT)
    return RES_NOTRDY;

  switch (cmd) {
    // Make sure that no pending write process
    case CTRL_SYNC :
      res = RES_OK;
      break;

    // Get number of sectors on the disk (DWORD)
    case GET_SECTOR_COUNT : {
      SD_CardInfo CardInfo;
      BSP_SD_GetCardInfo (&CardInfo);
      *(DWORD*)buff = CardInfo.CardCapacity / BLOCK_SIZE;
      res = RES_OK;
      break;
      }

    // Get R/W sector size (WORD)
    case GET_SECTOR_SIZE :
      *(WORD*)buff = BLOCK_SIZE;
      res = RES_OK;
      break;

    // Get erase block size in unit of sector (DWORD)
    case GET_BLOCK_SIZE :
      *(DWORD*)buff = BLOCK_SIZE;
      res = RES_OK;
      break;

    default:
      res = RES_PARERR;
    }

  return res;
  }
/*}}}*/

/*{{{*/
DRESULT disk_read (BYTE pdrv, BYTE* buff, DWORD sector, UINT count) {
  return BSP_SD_ReadBlocks ((uint32_t*)buff, (uint64_t)(sector * BLOCK_SIZE), BLOCK_SIZE, count) == MSD_OK ? RES_OK : RES_ERROR;
  }
/*}}}*/
/*{{{*/
DRESULT disk_write (BYTE pdrv, const BYTE* buff, DWORD sector, UINT count) {
  return BSP_SD_WriteBlocks ((uint32_t*)buff, (uint64_t)(sector * BLOCK_SIZE), BLOCK_SIZE, count) == MSD_OK ? RES_OK : RES_ERROR;
  }
/*}}}*/

#if _FS_REENTRANT
  /*{{{*/
  int ff_cre_syncobj (BYTE vol, _SYNC_t *sobj) {
    osSemaphoreDef (SEM);
    *sobj = osSemaphoreCreate (osSemaphore(SEM), 1);
    return *sobj != NULL;
    }
  /*}}}*/
  /*{{{*/

  int ff_del_syncobj (_SYNC_t sobj) {
    osSemaphoreDelete (sobj);
    return 1;
    }
  /*}}}*/
  /*{{{*/
  int ff_req_grant (_SYNC_t sobj) {
    int ret = 0;
    if (osSemaphoreWait(sobj, _FS_TIMEOUT) == osOK)
      ret = 1;
    return ret;
    }
  /*}}}*/
  /*{{{*/
  void ff_rel_grant (_SYNC_t sobj) {
    osSemaphoreRelease(sobj);
    }
  /*}}}*/
#endif

/*{{{*/
void* ff_memalloc (UINT msize) {
  return pvPortMalloc (msize);
  }
/*}}}*/
/*{{{*/
void ff_memfree (void* mblock) {
  vPortFree (mblock);
  }
/*}}}*/
